In [2]:
import pandas as pd
import numpy as np

In [4]:
dados = {'Nome': ['Anderson', 'Beatriz', 'Bruno', 'Cristiano', 'Daniel', 'Douglas', 'Elena', 'Fabricio', 'Gabriel', 'Janaina', 'Luiz', 'Marcos', 'Nadia', 'Oswaldo', 'Patricia', 'Ricardo'],'Idade': [24, 36, 45, 56, 29, 20, 38, 47, 23, 56, 32, 22, 36, 68, 22, 38],
         'Cidade': ['Santos', 'Atibaia', 'Guarulhos', 'Atibaia', 'Santos', 'Guarulhos', 'Guarulhos', 'Atibaia', 'Guarulhos', 'Guarulhos', 'Atibaia', 'Guarulhos', 'Santos', 'Guarulhos', 'Guarulhos', 'Santos'],
         'Registro': [32123, 45828, 34985, 13457, 98439, 99348, 45019, 24894, 32948, 13480, 22884, 56821, 65938, 12956, 75439, 45392],
         'Departamento': ['RH', 'PD', 'RH', 'ADM', 'ADM', 'RH', 'ADM', 'PD', 'PD', 'ADM', 'PD', 'ADM', 'PD', 'RH', 'ADM', 'PD'],
         'Formação': ['Graduação', 'Mestrado', 'Graduação', 'Técnico', 'Graduação', 'Técnico', 'Graduação', 'Graduação', 'Técnico', 'Graduação', 'Graduação', 'Graduação', 'Graduação', 'Mestrado', 'Graduação', 'Mestrado']}

In [5]:
dafra= pd.DataFrame(dados)

In [6]:
print(dafra)

         Nome  Idade     Cidade  Registro Departamento   Formação
0    Anderson     24     Santos     32123           RH  Graduação
1     Beatriz     36    Atibaia     45828           PD   Mestrado
2       Bruno     45  Guarulhos     34985           RH  Graduação
3   Cristiano     56    Atibaia     13457          ADM    Técnico
4      Daniel     29     Santos     98439          ADM  Graduação
5     Douglas     20  Guarulhos     99348           RH    Técnico
6       Elena     38  Guarulhos     45019          ADM  Graduação
7    Fabricio     47    Atibaia     24894           PD  Graduação
8     Gabriel     23  Guarulhos     32948           PD    Técnico
9     Janaina     56  Guarulhos     13480          ADM  Graduação
10       Luiz     32    Atibaia     22884           PD  Graduação
11     Marcos     22  Guarulhos     56821          ADM  Graduação
12      Nadia     36     Santos     65938           PD  Graduação
13    Oswaldo     68  Guarulhos     12956           RH   Mestrado
14   Patricia     22  Guarulhos     75439          ADM  Graduação
15    Ricardo     38     Santos     45392           PD   Mestrado

In [14]:
cidade = dafra.groupby('Cidade').groups

In [15]:
print(cidade)

{'Atibaia': [1, 3, 7, 10], 'Guarulhos': [2, 5, 6, 8, 9, 11, 13, 14], 'Santos': [0, 4, 12, 15]}

In [18]:
formacao = dafra.groupby('Formação').groups
print(formacao)

{'Graduação': [0, 2, 4, 6, 7, 9, 10, 11, 12, 14], 'Mestrado': [1, 13, 15], 'Técnico': [3, 5, 8]}

In [19]:
departamento = dafra.groupby('Departamento').groups
print(departamento)

{'ADM': [3, 4, 6, 9, 11, 14], 'PD': [1, 7, 8, 10, 12, 15], 'RH': [0, 2, 5, 13]}

In [23]:
cid_dep = dafra.groupby(['Cidade','Departamento']).groups
print(cid_dep)

{('Atibaia', 'ADM'): [3], ('Atibaia', 'PD'): [1, 7, 10], ('Guarulhos', 'ADM'): [6, 9, 11, 14], ('Guarulhos', 'PD'): [8], ('Guarulhos', 'RH'): [2, 5, 13], ('Santos', 'ADM'): [4], ('Santos', 'PD'): [12, 15], ('Santos', 'RH'): [0]}

In [32]:
dep_for = dafra.groupby(['Departamento', 'Formação']).groups
print(dep_for)

{('ADM', 'Graduação'): [4, 6, 9, 11, 14], ('ADM', 'Técnico'): [3], ('PD', 'Graduação'): [7, 10, 12], ('PD', 'Mestrado'): [1, 15], ('PD', 'Técnico'): [8], ('RH', 'Graduação'): [0, 2], ('RH', 'Mestrado'): [13], ('RH', 'Técnico'): [5]}

diferença entre a média e o valor de cada subgrupo

In [30]:
sub = lambda sub : sub.mean()-sub

In [41]:
cid_2 = dafra.groupby('Cidade')[['Idade', 'Registro']]
cid_2.transform(sub)

    Idade  Registro
0    7.75  28350.00
1    6.75 -19062.25
2   -8.25  11389.50
3  -13.25  13308.75
4    2.75 -37966.00
5   16.75 -52973.50
6   -1.25   1355.50
7   -4.25   1871.75
8   13.75  13426.50
9  -19.25  32894.50
10  10.75   3881.75
11  14.75 -10446.50
12  -4.25  -5465.00
13 -31.25  33418.50
14  14.75 -29064.50
15  -6.25  15081.00

In [44]:
form_2 = dafra.groupby('Formação')[['Idade', 'Registro']]
form_2.transform(sub)

        Idade      Registro
0   11.100000  14879.200000
1   11.333333 -11102.666667
2   -9.900000  12017.200000
3  -23.000000  35127.333333
4    6.100000 -51436.800000
5   13.000000 -50763.666667
6   -2.900000   1983.200000
7  -11.900000  22108.200000
8   10.000000  15636.333333
9  -20.900000  33522.200000
10   3.100000  24118.200000
11  13.100000  -9818.800000
12  -0.900000 -18935.800000
13 -20.666667  21769.333333
14  13.100000 -28436.800000
15   9.333333 -10666.666667

In [47]:
dep_2 = dafra.groupby('Departamento')[['Idade', 'Registro']]
dep_2.transform(sub)

        Idade      Registro
0   15.250000  12730.000000
1   -0.666667  -6180.666667
2   -5.750000   9868.000000
3  -18.833333  36985.500000
4    8.166667 -47996.500000
5   19.250000 -54495.000000
6   -0.833333   5423.500000
7  -11.666667  14753.333333
8   12.333333   6699.333333
9  -18.833333  36962.500000
10   3.333333  16763.333333
11  15.166667  -6378.500000
12  -0.666667 -26290.666667
13 -28.750000  31897.000000
14  15.166667 -24996.500000
15  -2.666667  -5744.666667

In [51]:
cid_dep_2 = dafra.groupby(['Cidade', 'Departamento'])['Idade']
cid_dep_2.transform(sub)

0      0.000000
1      2.333333
2     -0.666667
3      0.000000
4      0.000000
5     24.333333
6     -3.500000
7     -8.666667
8      0.000000
9    -21.500000
10     6.333333
11    12.500000
12     1.000000
13   -23.666667
14    12.500000
15    -1.000000
Name: Idade, dtype: float64

In [56]:
dep_form_2 = dafra.groupby(['Departamento', 'Formação'])['Idade']
dep_form_2.transform(sub)

0     10.500000
1      1.000000
2    -10.500000
3      0.000000
4      4.400000
5      0.000000
6     -4.600000
7     -8.666667
8      0.000000
9    -22.600000
10     6.333333
11    11.400000
12     2.333333
13     0.000000
14    11.400000
15    -1.000000
Name: Idade, dtype: float64